In [2]:
import pandas as pd
#create dummy data
df_a = pd.DataFrame({
       'subject_id': ['1', '2', '3', '4', '5'],
       'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
       'last_name' : ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']})

df_b = pd.DataFrame({
       'subject_id': ['4', '5', '6', '7', '8'],
       'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
       'last_name' : ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']})

df_c = pd.DataFrame({
       'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
       'test_id'   : [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]})

In [3]:
pd.merge(df_a, df_c, on='subject_id')

  first_name last_name subject_id  test_id
0       Alex  Anderson          1       51
1        Amy  Ackerman          2       15
2      Allen       Ali          3       15
3      Alice      Aoni          4       61
4     Ayoung   Atiches          5       16

In [4]:
#Merge outer join
pd.merge(df_a, df_b, on='subject_id', how='outer')

  first_name_x last_name_x subject_id first_name_y last_name_y
0         Alex    Anderson          1          NaN         NaN
1          Amy    Ackerman          2          NaN         NaN
2        Allen         Ali          3          NaN         NaN
3        Alice        Aoni          4        Billy      Bonder
4       Ayoung     Atiches          5        Brian       Black
5          NaN         NaN          6         Bran     Balwner
6          NaN         NaN          7        Bryce       Brice
7          NaN         NaN          8        Betty      Btisan

In [5]:
#merge with inner join
pd.merge(df_a, df_b, on='subject_id', how='inner')

  first_name_x last_name_x subject_id first_name_y last_name_y
0        Alice        Aoni          4        Billy      Bonder
1       Ayoung     Atiches          5        Brian       Black

In [6]:
#merge with right join
pd.merge(df_a, df_b, on='subject_id', how='right')

  first_name_x last_name_x subject_id first_name_y last_name_y
0        Alice        Aoni          4        Billy      Bonder
1       Ayoung     Atiches          5        Brian       Black
2          NaN         NaN          6         Bran     Balwner
3          NaN         NaN          7        Bryce       Brice
4          NaN         NaN          8        Betty      Btisan

In [7]:
#merge with left join
pd.merge(df_a, df_b, on='subject_id', how='left')

  first_name_x last_name_x subject_id first_name_y last_name_y
0         Alex    Anderson          1          NaN         NaN
1          Amy    Ackerman          2          NaN         NaN
2        Allen         Ali          3          NaN         NaN
3        Alice        Aoni          4        Billy      Bonder
4       Ayoung     Atiches          5        Brian       Black